rmptxf/nrf52_ble_tester_project/nRF5SDK/v16/projects/ble_peripheral/ble_app_tester/main.c
/**@brief Function for initializing the battery ble service.
 */
static void bas_init()
{
    uint32_t           err_code;
    ble_bas_init_t     bas_init;

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for handling the leds characteristic received data.
 *
 * @param[in]   commands   commands the app sent.
 * @param[in]   length     The length of the commands in bytes.
 */
static void leds_states_char_commands_handler(uint8_t const * commands, uint16_t length)
{
   ret_code_t   err_code;
   // limit the led indexs to form 2 to 4
   for(uint8_t i=2; i<length+2; i++)
   {
      commands[i-2] == 0 ? bsp_board_led_off(i) : bsp_board_led_on(i);
   }
}

/**@brief Function for handling the custom Service events.
 *
 * @details This function will be called for all Custom Service ble events which are passed to
 *          the application.
 *
 * @param[in]   ble_cus_t   Custom Service structure.
 * @param[in]   p_evt       Event received from the Custom Service.
 */

static void cus_evt_handler(ble_cus_t * p_cus, ble_cus_evt_t * p_evt)
{
  ret_code_t   err_code;

  switch(p_evt->evt_type)
  {
    case BLE_LEDS_STATES_CHAR_EVT_COMMAND_RX:
    {
        NRF_LOG_INFO("leds states char commands received.");
        for(uint8_t i=0; i<2; i++)
        {
          NRF_LOG_INFO("led[%d] new state : %d .", i, p_evt->params_command.command_data.p_data[i]);
        }
        leds_states_char_commands_handler(p_evt->params_command.command_data.p_data, p_evt->params_command.command_data.length);

    } break;

    case BLE_BUTTONS_STATES_CHAR_NOTIFICATIONS_ENABLED:
    {
        NRF_LOG_INFO("buttons states char notifications are enabled.");

    } break;

    case BLE_BUTTONS_STATES_CHAR_NOTIFICATIONS_DISABLED:
    {
        NRF_LOG_INFO("buttons states char notifications are disabled.");

    } break;

    case BLE_POTENTIO_LEVEL_CHAR_NOTIFICATIONS_ENABLED:
    {
        NRF_LOG_INFO("potentio level char notifications are enabled.");

    } break;

    case BLE_POTENTIO_LEVEL_CHAR_NOTIFICATIONS_DISABLED:
    {
        NRF_LOG_INFO("potentio level char notifications are disabled.");

    } break;

    default:
    break;
  }
}


/**@brief Function for initializing the Custom ble service.
 */
static void cus_init(void)
{
   ret_code_t          err_code;
   ble_cus_init_t      cus_init = {0};

   cus_init.evt_handler  = cus_evt_handler; 

   err_code = ble_cus_init(&m_cus, &cus_init);
   APP_ERROR_CHECK(err_code);
} 


static void qwr_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
  qwr_init();
  cus_init();
  bas_init();
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting timers.
 */
static void application_timers_start(void)
{
    ret_code_t  err_code;

    err_code = app_timer_start(m_battery_timer_id, BATTERY_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_saadc_timer_id, SAADC_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code); 
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;

        default:
            break;
    }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected.");
            // LED indication will be changed when advertising starts.
            break;

        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected.");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

