rmptxf/nrf52_ble_tester_project/nRF5SDK/v16/projects/ble_peripheral/ble_app_tester/main.c
   case BUTTON_4:
   {
     if(button_action == APP_BUTTON_PUSH) 
     {
        NRF_LOG_INFO("Button_4 is pushed.");
     }
     else if(button_action == APP_BUTTON_RELEASE) 
     {
        NRF_LOG_INFO("Button_4 is released.");
     }
   }break;

   default:
     return; // no implementation needed
  }

    m_buttons_states[get_button_index(button_pin)] = button_action;
    buttons_states_update();
}


/**@brief Function for buttons configuration.
 */
static const app_button_cfg_t app_buttons[BUTTONS_NUMBER] = 
{
    {BUTTON_1, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler},
    {BUTTON_2, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler},
    {BUTTON_3, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler},
    {BUTTON_4, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler}
}; 

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_init((app_button_cfg_t *)app_buttons,
                                                BUTTONS_NUMBER,
                                         BUTTON_DETECTION_TIME);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for updating the potentio level.
 */
static void potentio_level_update(void)
{
    ret_code_t err_code;
    err_code = ble_cus_potentio_level_update(&m_cus, potentio_level, m_conn_handle);
    if (err_code != NRF_SUCCESS &&
        err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
        err_code != NRF_ERROR_INVALID_STATE &&
        err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        APP_ERROR_CHECK(err_code);
    }
}

// the saadc callback function
void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{ 
   ret_code_t err_code;

    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {     
        uint16_t saadc_voltages[2] = {0};

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);

        for (uint8_t i = 0; i < SAMPLES_IN_BUFFER; i++)
        {
            saadc_voltages[i] = ADC_RESULT_IN_MILLI_VOLTS(p_event->data.done.p_buffer[i]);
        }

        battery_level = battery_level_in_percent(saadc_voltages[0]);
        potentio_level = (saadc_voltages[1]*100)/saadc_voltages[0];

#if SAADC_LOG_ENABLED
        NRF_LOG_INFO("---- saadc event number : %d ----", m_adc_evt_counter);

        NRF_LOG_INFO("battery measured voltage  : %d mV.", saadc_voltages[0]);
        NRF_LOG_INFO("battery level  : %d.", battery_level);

        NRF_LOG_INFO("potentio measured voltage : %d mV.", saadc_voltages[1]);
        NRF_LOG_INFO("potentio level : %d.", potentio_level);
#endif
        potentio_level_update();

        m_adc_evt_counter++;
    }
}

// intialising the saadc
void saadc_init(void)
{
    ret_code_t err_code;
    // channel0 input set to vdd
    nrf_saadc_channel_config_t channel0_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
 
    // channel1 input set to the potentiometer output
    nrf_saadc_channel_config_t channel1_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(POTENTIO_ANALOG_PIN);

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel0_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(1, &channel1_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();

    saadc_init();

    // Start execution.
    NRF_LOG_INFO("Tester application started.");
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
